In [ ]:
# question 1

In [2]:
import pandas as pd
course_name = ['Data Science', 'Machine Learning', 'Big Data', 'Data Engineer']
duration = [2,3,6,4]
df = pd.DataFrame(data = {'course_name' : course_name, 'duration' : duration})

In [3]:
df

        course_name  duration
0      Data Science         2
1  Machine Learning         3
2          Big Data         6
3     Data Engineer         4

In [8]:
df[['course_name','duration']][1:2]

        course_name  duration
1  Machine Learning         3

In [ ]:
# question 2

In [ ]:
# iloc() function takes in built indexes while loc() function takes user defined indexes also iloc() function exclude the upperbound value but loc() function takes the upperbound values also.

In [ ]:
# question3

In [9]:
df

        course_name  duration
0      Data Science         2
1  Machine Learning         3
2          Big Data         6
3     Data Engineer         4

In [10]:
new_df=df.reindex([3,0,1,2])

In [11]:
new_df

        course_name  duration
3     Data Engineer         4
0      Data Science         2
1  Machine Learning         3
2          Big Data         6

In [13]:
new_df.iloc[2]

course_name    Machine Learning
duration                      3
Name: 1, dtype: object

In [14]:
new_df.loc[2]

course_name    Big Data
duration              6
Name: 2, dtype: object

In [ ]:
# here the difference between iloc and loc is iloc takes the inbuilt 2nd index but loc takes user defined 2nd index

In [ ]:
# question 4

In [15]:
import pandas as pd
import numpy as np
columns = ['column_1', 'column_2', 'column_3', 'column_4', 'column_5', 'column_6']
indices = [1,2,3,4,5,6]
#Creating a dataframe:
df1 = pd.DataFrame(np.random.rand(6,6), columns = columns, index = indices)

In [16]:
df1

   column_1  column_2  column_3  column_4  column_5  column_6
1  0.984748  0.912437  0.138688  0.251435  0.087400  0.894470
2  0.166044  0.587567  0.164400  0.137620  0.405777  0.794295
3  0.558439  0.053314  0.668835  0.328910  0.752093  0.869764
4  0.995044  0.023822  0.186541  0.609082  0.470059  0.650015
5  0.253078  0.143288  0.363391  0.022546  0.593394  0.048898
6  0.702755  0.250164  0.847265  0.459333  0.882993  0.191906

In [19]:
df1[['column_1','column_2','column_3','column_4','column_5','column_6']].mean()

column_1    0.610018
column_2    0.328432
column_3    0.394853
column_4    0.301488
column_5    0.531953
column_6    0.574892
dtype: float64

In [20]:
df1['column_2'].std()

0.3513101391172531

In [ ]:
# question 6

In [ ]:
# The window function performs an analysis across a group of table rows that are somehow related to the current row. This is similar to the kind of calculation that an aggregate function can perform.
# type of window functions - min,max,sum,mean,median,std

In [ ]:
# question 8

In [39]:
d1=pd.to_datetime('2023-04-03')

In [40]:
d2=pd.to_datetime('2023-04-05')

In [41]:
d2-d1

Timedelta('2 days 00:00:00')

In [ ]:
# question 11

In [58]:
pd.read_csv('students_data.csv')

   student_id  test_score
0           1          85
1           2          90
2           3          80
3           4          75
4           5          85
5           6          82
6           7          78
7           8          85
8           9          90
9          10          85

In [60]:
students_data['test_score'].mean()

83.5

In [62]:
students_data['test_score'].median()

85.0

In [63]:
students_data['test_score'].mode()

0    85
Name: test_score, dtype: int64